In [2]:
import pandas as pd

In [3]:
import json

# Open and load the JSON file
with open('sample4.json', 'r') as file:
    data = json.load(file)

# Print the data to inspect its structure
print(data)

{'people': [{'firstName': 'Joe', 'lastName': 'Jackson', 'gender': 'male', 'age': 28, 'number': '7349282382'}, {'firstName': 'James', 'lastName': 'Smith', 'gender': 'male', 'age': 32, 'number': '5678568567'}, {'firstName': 'Emily', 'lastName': 'Jones', 'gender': 'female', 'age': 24, 'number': '456754675'}]}

In [4]:
df=pd.DataFrame(data)
df

                                              people
0  {'firstName': 'Joe', 'lastName': 'Jackson', 'g...
1  {'firstName': 'James', 'lastName': 'Smith', 'g...
2  {'firstName': 'Emily', 'lastName': 'Jones', 'g...

In [5]:
df.dtypes

people    object
dtype: object

In [6]:
df.describe()

                                                   people
count                                                   3
unique                                                  3
top     {'firstName': 'Joe', 'lastName': 'Jackson', 'g...
freq                                                    1

In [7]:
df.head(2)

                                              people
0  {'firstName': 'Joe', 'lastName': 'Jackson', 'g...
1  {'firstName': 'James', 'lastName': 'Smith', 'g...

In [8]:
df.tail(1)

                                              people
2  {'firstName': 'Emily', 'lastName': 'Jones', 'g...

In [9]:
df.iloc[0:1]

                                              people
0  {'firstName': 'Joe', 'lastName': 'Jackson', 'g...

In [10]:
df.shape

(3, 1)

In [11]:
 pd.isnull(data)

False

In [12]:
 df.rename(columns = {'firstName':'FName'})

                                              people
0  {'firstName': 'Joe', 'lastName': 'Jackson', 'g...
1  {'firstName': 'James', 'lastName': 'Smith', 'g...
2  {'firstName': 'Emily', 'lastName': 'Jones', 'g...

In [13]:
df.iloc[1:3]

                                              people
1  {'firstName': 'James', 'lastName': 'Smith', 'g...
2  {'firstName': 'Emily', 'lastName': 'Jones', 'g...